stress_test_results/ab_test_0.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        TornadoServer/6.4.2
Server Hostname:        127.0.0.1
Server Port:            30070

Document Path:          /
Document Length:        1837 bytes

Concurrency Level:      500
Time taken for tests:   22.291 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      111150000 bytes
HTML transferred:       91850000 bytes
Requests per second:    2243.04 [#/sec] (mean)
Time per request:       222.912 [ms] (mean)
Time per request:       0.446 [ms] (mean, across all concurrent requests)
Transfer rate:          4869.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.2      0      31
Processing:     1  215 409.7    111    3470
Waiting:        1  215 409.7    111    3470
Total:          1  215 409.7    111    3470

Percentage of the requests served within a certain time (ms)
  50%    111
  66%    134
  75%    152
  80%    165
  90%    236
  95%   1185
  98%   1240
  99%   2192
 100%   3470 (longest request)