stress_test_results/ab_test_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        1837 bytes

Concurrency Level:      500
Time taken for tests:   15.382 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      110650000 bytes
HTML transferred:       91850000 bytes
Requests per second:    3250.60 [#/sec] (mean)
Time per request:       153.818 [ms] (mean)
Time per request:       0.308 [ms] (mean, across all concurrent requests)
Transfer rate:          7024.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.0      0      41
Processing:     2  152 112.8    136     740
Waiting:        2  151 112.8    135     740
Total:          2  152 112.7    136     741

Percentage of the requests served within a certain time (ms)
  50%    136
  66%    185
  75%    220
  80%    244
  90%    309
  95%    358
  98%    429
  99%    471
 100%    741 (longest request)