stress_test_results/ab_test_2.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        TornadoServer/6.4.2
Server Hostname:        127.0.0.1
Server Port:            30070

Document Path:          /
Document Length:        1837 bytes

Concurrency Level:      500
Time taken for tests:   10.409 seconds
Complete requests:      50000
Failed requests:        1013
   (Connect: 0, Receive: 0, Length: 1013, Exceptions: 0)
Total transferred:      108898101 bytes
HTML transferred:       89989119 bytes
Requests per second:    4803.76 [#/sec] (mean)
Time per request:       104.085 [ms] (mean)
Time per request:       0.208 [ms] (mean, across all concurrent requests)
Transfer rate:          10217.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.6      0      34
Processing:     1  102 112.1     94    1255
Waiting:        0  101 112.7     94    1255
Total:          1  103 112.0     95    1255

Percentage of the requests served within a certain time (ms)
  50%     95
  66%    101
  75%    106
  80%    110
  90%    131
  95%    157
  98%    195
  99%   1015
 100%   1255 (longest request)