stress_test_results/ab_test_2.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        TornadoServer/6.4.2
Server Hostname:        127.0.0.1
Server Port:            30070

Document Path:          /
Document Length:        1837 bytes

Concurrency Level:      500
Time taken for tests:   9.700 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      111150000 bytes
HTML transferred:       91850000 bytes
Requests per second:    5154.70 [#/sec] (mean)
Time per request:       96.999 [ms] (mean)
Time per request:       0.194 [ms] (mean, across all concurrent requests)
Transfer rate:          11190.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.8      0      33
Processing:    15   95   9.0     96     136
Waiting:        2   95   9.4     96     136
Total:         36   96   7.1     97     136

Percentage of the requests served within a certain time (ms)
  50%     97
  66%     98
  75%    100
  80%    101
  90%    103
  95%    106
  98%    110
  99%    113
 100%    136 (longest request)